const MORSE_TABLE = {
    '.-': 'a',
    '-...': 'b',
    '-.-.': 'c',
    '-..': 'd',
    '.': 'e',
    '..-.': 'f',
    '--.': 'g',
    '....': 'h',
    '..': 'i',
    '.---': 'j',
    '-.-': 'k',
    '.-..': 'l',
    '--': 'm',
    '-.': 'n',
    '---': 'o',
    '.--.': 'p',
    '--.-': 'q',
    '.-.': 'r',
    '...': 's',
    '-': 't',
    '..-': 'u',
    '...-': 'v',
    '.--': 'w',
    '-..-': 'x',
    '-.--': 'y',
    '--..': 'z',
    '.----': '1',
    '..---': '2',
    '...--': '3',
    '....-': '4',
    '.....': '5',
    '-....': '6',
    '--...': '7',
    '---..': '8',
    '----.': '9',
    '-----': '0',
    ' ': ' ',
};

function decode(expr) {
    // arr массив для разделения по 10 исходной строки с закодированным сообщением
    let arr = [];
    // temp массив для преобразования в сообщения морзянки
    let temp = [];
    // final массив для получения декодированного сообщения
    let final = [];

    for (let i = 0; i < expr.length; i += 10) {
        arr.push(expr.slice(i, i + 10));
    }

    temp = arr.map(function (item) {
        return item.replace(/11/g, '-').replace(/10/g, '.').replace(/0/g, '').replace(/\*{10}/g, ' ');
    });


    for (let i = 0; i < temp.length; i++) {
        final.push(MORSE_TABLE[temp[i]]);
    }
    // по условиям задачи в конце вернуть строку
    return final.join('');
}

module.exports = {
    decode
}